-- MySQL dump 10.13  Distrib 8.0.38, for Win64 (x86_64)
--
-- Host: k11a402.p.ssafy.io    Database: cardo
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `company`
--

DROP TABLE IF EXISTS `company`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `company` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `company_no` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_deleted` bit(1) NOT NULL,
  `is_selected` bit(1) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint NOT NULL,
  PRIMARY KEY (`id`),
  KEY `FKdy4v2yb46hefqicjpyj7b7e4s` (`user_id`),
  CONSTRAINT `FKdy4v2yb46hefqicjpyj7b7e4s` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `company`
--

LOCK TABLES `company` WRITE;
/*!40000 ALTER TABLE `company` DISABLE KEYS */;
INSERT INTO `company` VALUES (1,'2024-11-08 14:06:10.219906','2024-11-13 09:23:41.693293','1001',_binary '\0',_binary '','KB국민카드',1),(2,'2024-11-08 14:06:10.234904','2024-11-13 09:23:41.694859','1009',_binary '\0',_binary '','하나카드',1),(3,'2024-11-08 14:06:10.243904','2024-11-12 13:21:47.238674','1005',_binary '\0',_binary '','신한카드',1),(4,'2024-11-08 14:06:10.252905','2024-11-13 09:23:41.696695','1002',_binary '\0',_binary '','삼성카드',1),(5,'2024-11-08 14:06:10.260903','2024-11-13 09:23:26.280379','1006',_binary '\0',_binary '','현대카드',1),(6,'2024-11-11 10:41:59.365672','2024-11-11 10:41:59.365672','1001',_binary '\0',_binary '\0','KB국민카드',3),(7,'2024-11-11 10:41:59.369732','2024-11-11 10:41:59.369732','1009',_binary '\0',_binary '\0','하나카드',3),(8,'2024-11-11 10:41:59.370708','2024-11-11 10:41:59.370708','1005',_binary '\0',_binary '\0','신한카드',3),(9,'2024-11-11 10:41:59.371853','2024-11-11 10:41:59.371853','1006',_binary '\0',_binary '\0','현대카드',3),(10,'2024-11-11 10:41:59.373046','2024-11-11 10:41:59.373046','1002',_binary '\0',_binary '\0','삼성카드',3),(11,'2024-11-11 10:42:31.544994','2024-11-11 10:42:31.544994','1001',_binary '\0',_binary '\0','KB국민카드',4),(12,'2024-11-11 10:42:31.546083','2024-11-11 10:42:31.546083','1009',_binary '\0',_binary '\0','하나카드',4),(13,'2024-11-11 10:42:31.547104','2024-11-11 10:42:31.547104','1005',_binary '\0',_binary '\0','신한카드',4),(14,'2024-11-11 10:42:31.549341','2024-11-11 10:42:31.549341','1006',_binary '\0',_binary '\0','현대카드',4),(15,'2024-11-11 10:42:31.550829','2024-11-11 10:42:31.550829','1002',_binary '\0',_binary '\0','삼성카드',4),(16,'2024-11-11 10:47:13.105264','2024-11-11 10:52:23.568985','1001',_binary '\0',_binary '','KB국민카드',5),(17,'2024-11-11 10:47:13.106554','2024-11-11 10:52:23.571098','1009',_binary '\0',_binary '','하나카드',5),(18,'2024-11-11 10:47:13.107662','2024-11-11 10:52:23.572740','1005',_binary '\0',_binary '','신한카드',5),(19,'2024-11-11 10:47:13.108642','2024-11-11 10:52:23.574235','1006',_binary '\0',_binary '','현대카드',5),(20,'2024-11-11 10:47:13.109733','2024-11-11 10:52:23.575792','1002',_binary '\0',_binary '','삼성카드',5),(21,'2024-11-11 10:53:43.731492','2024-11-11 10:53:48.416652','1001',_binary '\0',_binary '','KB국민카드',6),(22,'2024-11-11 10:53:43.732516','2024-11-11 10:53:48.418575','1009',_binary '\0',_binary '','하나카드',6),(23,'2024-11-11 10:53:43.733354','2024-11-11 10:53:48.420089','1005',_binary '\0',_binary '','신한카드',6),(24,'2024-11-11 10:53:43.734213','2024-11-11 10:53:48.421886','1006',_binary '\0',_binary '','현대카드',6),(25,'2024-11-11 10:53:43.735296','2024-11-11 10:53:48.423557','1002',_binary '\0',_binary '','삼성카드',6),(26,'2024-11-11 16:19:14.442074','2024-11-11 16:20:17.658277','1001',_binary '\0',_binary '','KB국민카드',7),(27,'2024-11-11 16:19:14.446815','2024-11-11 16:20:17.662342','1009',_binary '\0',_binary '','하나카드',7),(28,'2024-11-11 16:19:14.448502','2024-11-11 16:19:14.448502','1005',_binary '\0',_binary '\0','신한카드',7),(29,'2024-11-11 16:19:14.450074','2024-11-12 17:23:01.915557','1002',_binary '\0',_binary '','삼성카드',7),(30,'2024-11-11 16:19:14.452274','2024-11-12 17:23:01.917153','1006',_binary '\0',_binary '\0','현대카드',7),(31,'2024-11-12 10:39:08.255573','2024-11-12 10:39:15.329925','1001',_binary '\0',_binary '','KB국민카드',8),(32,'2024-11-12 10:39:08.259846','2024-11-12 10:39:15.337540','1009',_binary '\0',_binary '','하나카드',8),(33,'2024-11-12 10:39:08.261251','2024-11-12 10:39:15.339572','1005',_binary '\0',_binary '','신한카드',8),(34,'2024-11-12 10:39:08.262558','2024-11-12 10:39:15.341688','1002',_binary '\0',_binary '','삼성카드',8),(35,'2024-11-12 10:39:08.263827','2024-11-12 10:39:15.343819','1006',_binary '\0',_binary '','현대카드',8),(36,'2024-11-13 12:56:28.144174','2024-11-13 12:56:40.131034','1001',_binary '\0',_binary '','KB국민카드',9),(37,'2024-11-13 12:56:28.145163','2024-11-13 12:56:40.132718','1009',_binary '\0',_binary '','하나카드',9),(38,'2024-11-13 12:56:28.146019','2024-11-13 12:56:40.134020','1005',_binary '\0',_binary '','신한카드',9),(39,'2024-11-13 12:56:28.147024','2024-11-13 12:56:40.135340','1002',_binary '\0',_binary '','삼성카드',9),(40,'2024-11-13 12:56:28.147876','2024-11-13 12:56:40.136512','1006',_binary '\0',_binary '','현대카드',9),(41,'2024-11-13 14:08:00.975284','2024-11-13 14:08:10.451407','1001',_binary '\0',_binary '','KB국민카드',10),(42,'2024-11-13 14:08:00.976117','2024-11-13 14:08:10.452817','1009',_binary '\0',_binary '','하나카드',10),(43,'2024-11-13 14:08:00.976868','2024-11-13 14:08:10.454114','1005',_binary '\0',_binary '','신한카드',10),(44,'2024-11-13 14:08:00.977662','2024-11-13 14:08:10.455363','1002',_binary '\0',_binary '','삼성카드',10),(45,'2024-11-13 14:08:00.978437','2024-11-13 14:08:10.456550','1006',_binary '\0',_binary '','현대카드',10),(46,'2024-11-13 14:24:28.836608','2024-11-13 14:24:39.330622','1001',_binary '\0',_binary '','KB국민카드',11),(47,'2024-11-13 14:24:28.837429','2024-11-13 14:24:39.331883','1009',_binary '\0',_binary '','하나카드',11),(48,'2024-11-13 14:24:28.838144','2024-11-13 14:24:39.333058','1005',_binary '\0',_binary '','신한카드',11),(49,'2024-11-13 14:24:28.838832','2024-11-13 14:24:39.334110','1002',_binary '\0',_binary '','삼성카드',11),(50,'2024-11-13 14:24:28.839411','2024-11-13 14:24:39.335136','1006',_binary '\0',_binary '','현대카드',11),(51,'2024-11-18 10:16:54.796026','2024-11-18 10:17:03.763476','1001',_binary '\0',_binary '','KB국민카드',12),(52,'2024-11-18 10:16:54.796944','2024-11-18 10:17:03.764958','1009',_binary '\0',_binary '','하나카드',12),(53,'2024-11-18 10:16:54.797681','2024-11-18 10:17:03.766139','1005',_binary '\0',_binary '','신한카드',12),(54,'2024-11-18 10:16:54.798435','2024-11-18 10:17:03.767383','1002',_binary '\0',_binary '','삼성카드',12),(55,'2024-11-18 10:16:54.799102','2024-11-18 10:17:03.768533','1006',_binary '\0',_binary '','현대카드',12);
/*!40000 ALTER TABLE `company` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-11-18 13:25:25
